# GetValues Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTable..::..GetValues Method
ExportLineweightTable Class See Also
---
Returns all the values stored in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<ExportLineweightInfo> GetValues()
```

Visual Basic
---
```text
Public Function GetValues As IList(Of ExportLineweightInfo)
```

Visual C++
---
```text
public:
IList<ExportLineweightInfo^>^ GetValues()
```

# ### Return Value
The info.
# See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace